{
  "Where are the electives listed for the undergraduate programs?": "The elective lists for the CS/CpE and IT programs are on the  undergraduate electives page . ",
  "Where are the key forms located for the undergraduate programs?": "Key forms can be found on the  undergraduate forms page . On this page you will find the independent study form, industry internship form, and many other useful forms. ",
  "How do waiting lists work?": "Waiting lists as run by the Registrar's Office do not fully support multiple course sections, split graduate/undergraduate courses, and other attributes of our courses. In past semesters we have had many problems when using waiting lists. Starting in Spring 2019, waiting lists will no longer be used. We will continue to survey students during the registration period for problems with scheduling courses and will intervene as necessary. Our goal is that every student have a full schedule every semester. Watch for emails from the Department Advisor during registation. ",
  "How can I find an internship?": "One big advantage of being a student in a large urban university is the internship opportunities. Many Tampa Bay area companies hire CSE students for part-time during fall and spring semesters and full-time during summer. You start your search at USF Career Services . You should also read the  CSE student newsletter when you receive it in your email inbox. There are many job search web sites, indeed.com is one such web site. ",
  "Can I get academic credit for an internship?": "Industry Internship (CIS 4940 for CS and CpE students, CIS 4947 for IT and CyS students) can be used to grant academic credit for an internship (typically, 3 credit hours for a 20 hour/wk one semester internship). The contract form for CIS 4940 and CIS 4947 can be found on the  undergraduate forms page . Similar to Independent Study you will need to have a supervising faculty member. This faculty member must agree that your internship is suitable for academic credit (not all internships are suitable). The supervising faculty member will establish the requirements for the internship, which will typically include a mid-term and final report. You cannot receive credit for an internship completed in a past semester for which you did not have a supervising faculty member. ",
  "Are there any Departmental scholarships?": "For more information on Department and College scholarships, see here . At the University level, the Office of National Scholarships is dedicated to providing guidance and support for USF's high achieving students as they compete for national merit scholarships across all discipline. The Scholarships and Financial Aid Services office has resources for financial aid (including information on how to qualify for FWS positions). Some of our students have had good success with finding scholarships and internships using Pathways to Science . ",
  "How does grade forgiveness work?": "Grade forgiveness is described in the undergraduate catalog . ",
  "What are excess hours?": "Excess hours are described in the undergraduate catalog . ",
  "Who is the undergraduate advisor and where can I find him or her?": "The undergraduate advisors for all four Department undergraduate programs are John Morgan and Marjorie Fontalvo. Contact information (including office location, office hours, telephone number, and email address) are listed  here . ",
  "What are the admission requirements for the CS and CpE programs?": "The admission requirements for the CS and CpE program are described in the undergraduate catalog . Program flowcharts found here summarize the catalog information. Admission to the CS or CpE program requires a minimum of 3.1 GPA average in Calculus 1 and 2, Physics (with Calculus) 1 and 2, and English 1 and 2 starting in Fall 2018. ",
  "How do I get a permit for Program Design (COP 3514)?": "For a Fall or Spring semester, you can find a link to an online permit request form by searching for Program Design in OASIS and the link will be immediately below the title of the course. For Summer semester, please see the Department CS and CpE undergraduate advisor. Permits are awarded based on availability and progress and performance in the courses required for admission into the CS and CpE programs (3.1 GPA for Calculus I and II, Physics I and II, and Composition I and II starting in Fall 2018). Permits are not granted to students whose grades are unlikely to meet the Department admission requirements and/or who have not completed up to at least Calculus 2 and Physics 1. ",
  "Needs fixing": "For students not yet admitted into the Department, but who have met the course pre-req, you need to fill out a  Gate Course Enrollment Contract and turn it in to the Department CS and CpE undergraduate advisor. Permits are generally only awarded to students who have met Departmental admission criteria (3.1 GPA for Calculus I and II, Physics I and II, and Composition I and II starting in Fall 2018) and may be limited based on availability. ",
  "How do I get a permit for Computer Organization (CDA 3103)?": "For students not yet admitted into the Department, but who have met the course pre-req, you need to fill out a  Gate Course Enrollment Contract and turn it in to the Department CS and CpE undergraduate advisor. Permits are generally only awarded to students who have met Departmental admission criteria (3.1 GPA for Calculus I and II, Physics I and II, and Composition I and II starting in Fall 2018) and may be limited based on availability. ",
  "How do I get a permit for Object Oriented Design (COP 3331)?": "This is the same procedure as for requesting a permit for Computer Organization described above. Note that you must have passed Program Design with a B or better. ",
  "What is the pre-req for CIS 4900, CIS 4915, and CIS 4940?": "Pre-reqs for USF courses can be found in USF Course Inventory . The pre-reqs for CIS 4900, CIS 4915, and CIS 4940 are Data Structures (COP 4530) and Logic Design (CDA 3201). Consent of the Instructor and Department are required. ",
  "How many credit hours of CIS 4900, CIS 4915, and/or CIS 4940 can I have?": "A maximum of 6 credit hours of any combination of CIS 4900, CIS 4915, and/or CIS 4940 can be counted towards a BSCS or BSCpE. CIS 4900 is Independent Study in Computer Science, CIS 4915 is Supervised Research in Computer Science, and CIS 4940 is Industry Internship. See USF Course Inventory for more information. ",
  "What is Senior Project (CIS 4910) and where can I find more information?": "For Computer Engineering students Senior Project (CIS 4910) is a required capstone design experience as required for ABET accreditation. CIS 4910 is based on industry-contributed projects and all projects are completed in teams of 3 to 5 students. The web site for CIS 4910 is here . ",
  "How do I get a permit for Ethical Issues and Professional Conduct (CIS 4250)?": "Ethics is a course that is generally only taken in the last semester before you graduate, or in Spring if you are a Summer graduate. To receive a permit, you should fill out a  Graduation Checklist and meet with the Dr. Hendrix before the graduation application deadline for the semester of graduation. ",
  "What are the admission requirements for the IT and CyS program?": "The admission requirements for the IT program are described in the undergraduate catalog . Program flowcharts found here summarize the catalog information. ",
  "What is the pre-req for COP 4900 and CIS 4947?": "Pre-reqs for USF courses can be found in USF Course Inventory . The pre-req for COP 4900 and CIS 4947 is \"Senior Standing\". This means that you have completed at least Data Structures for IT. Consent of the Instructor and Department are required. ",
  "How many credit hours of COP 4900 and/or CIS 4947 can I have?": "You may earn up to 9 credit hours of COP 4900 and/or CIS 4947 credit, no more than 3 credit hours in any one given company for CIS 4947 credit. ",
  "What is Senior Project (CIS 4935) and where can I find more information?": "For IT and CyS students, Senior Project (CIS 4935) is a required capstone designed to allow students to gain experience in completing team-based IT projects. CIS 4935 is a course - projects are team-based and are made available to the students on the first day of class. CIS 4935 is typically taken in the student's last semester (or semester before last). To receive a permit, you should fill out a  Graduation Checklist and meet with the Dr. Small before the graduation application deadline for the semester of graduation. ",
  "How do I get a permit for Ethics for IT (CIS 4235)?": "Ethics is a course that is generally only taken in the last semester before you graduate, or in Spring if you are a Summer graduate. To receive a permit, you should fill out a  Graduation Checklist and meet with the Dr. Small before the graduation application deadline for the semester of graduation. "
}